#include <stdio.h>
#include <locale.h>

void main(void)

{
	setlocale(LC_ALL, "RUS");
	puts("Задание 1");
	printf("%20s \n ", "Это текст");
	printf("%-s \v ", "Это текст");
	puts("------------------------");
	printf("%10.5f\n ", 12.234657);
	puts("------------------------");
	printf("Деления %d на %d равен %d\n ", 7, 5, 7 / 5);
	printf("Умножение %d на %d равен %d\n ", 2000, 4, 2000 * 4);
	puts("------------------------");
	printf("%d разделить %d равно %d\n ", 5., 2., 5. / 2);
	printf("%f разделить %f равно %f\n ", 5., 2., 5. / 2);
	printf("%g разделить %g равно %g\n ", 5., 2., 5. / 2);
	printf("%e разделить %e равно %e\n ", 5., 2., 5. / 2);
	puts("Различие заключается в разных выводах чисел и количества цмфр после запятой");
	puts("------------------------");
	puts("Задание 2");
	int N, K;
	//printf("Сейчас %d часов %d минут 00 секунд\n", N, K); // пока хз как делать 

	getchar();

}