#include <stdio.h>
#include <locale.h>
#define _CRT_SECURE_NO_DEPRECATE

void main(void)

{
	setlocale(LC_ALL, "RUS");
	puts("Задание 1");
	printf("%20s \n ", "Это текст");
	printf("%-s \v ", "Это текст");
	puts("------------------------");
	printf("%10.5f\n ", 12.234657);
	puts("------------------------");
	printf("Деления %d на %d равен %d\n ", 7, 5, 7 / 5);
	printf("Умножение %d на %d равен %d\n ", 2000, 4, 2000 * 4);
	puts("------------------------");
	printf("%d разделить %d равно %d\n ", 5., 2., 5. / 2);
	printf("%f разделить %f равно %f\n ", 5., 2., 5. / 2);
	printf("%g разделить %g равно %g\n ", 5., 2., 5. / 2);
	printf("%e разделить %e равно %e\n ", 5., 2., 5. / 2);
	puts("Различие заключается в разных выводах чисел и количества цифр после запятой");
	puts("------------------------");
	puts("Задание 2");
	int N = 18, K = 33, L = 30;
	printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
	printf("Идет %d минута суток \n", N*60+K);
	printf("До полуночи осталось %d часов и %d минут\n", 24-N, 60-K);
	printf("С 8.00 прошло %d секунд\n",(N-8)*60*60);
	printf("Текущий час = %d/24 суток и текущая минута = %d/60 часа\n", N, K);
	puts("------------------------");
	puts("Задание 3");
	int n = 3;
	printf("Дано \n %d \n %d \n _______ \n %-7.3f\n ", n, 333, n / 333.);
	getchar();
}